onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДЗ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// + Ромина Ю.А. 2026-10-09 
    ДобавляемыеРеквизиты = Новый Массив;
    ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДЗ_КонтактноеЛицо", Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица"), , "Контактное лицо")); 	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДЗ_СогласованнаяСкидка", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 2)), , "Согласованная скидка"));	
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);

    ЭлементДЗ_КонтактноеЛицо = Элементы.Добавить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	ЭлементДЗ_КонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;  
	ЭлементДЗ_КонтактноеЛицо.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	ЭлементДЗ_КонтактноеЛицо.Заголовок = "Контактное лицо";
	
	ЭлементДЗ_ГруппаСкидка = Элементы.Добавить("ДЗ_ГруппаСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево); 
	ЭлементДЗ_ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементДЗ_ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;  
	ЭлементДЗ_ГруппаСкидка.ОтображатьЗаголовок = Ложь; 
	ЭлементДЗ_ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементДЗ_СогласованнаяСкидка = Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ДЗ_ГруппаСкидка);
	ЭлементДЗ_СогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;  
	ЭлементДЗ_СогласованнаяСкидка.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ЭлементДЗ_СогласованнаяСкидка.Заголовок = "Согласованная скидка";
	ЭлементДЗ_СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ДЗ_СогласованнаяСкидкаПриИзменении");
		
	ДЗ_Команда = Команды.Добавить("ПересчитатьТаблицу");
	ДЗ_Команда.Заголовок = "Пересчитать таблицу"; 
	ДЗ_Команда.Действие = "ДЗ_ПересчитатьТаблицу"; 
	
	ДЗ_КнопкаФормы = Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"), Элементы.ДЗ_ГруппаСкидка);
	ДЗ_КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	ДЗ_КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ДЗ_КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить; 
	ДЗ_КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыСкидка.УстановитьДействие("ПриИзменении", "ДЗ_ТоварыСкидкаПриИзменении");
	Элементы.Услуги.ПодчиненныеЭлементы.УслугиСкидка.УстановитьДействие("ПриИзменении", "ДЗ_УслугиСкидкаПриИзменении");
	// - Ромина Ю.А. 2026-10-09 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// + Ромина Ю.А. 2026-10-09 
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество)*(1 - Объект.ДЗ_СогласованнаяСкидка/100);
	ТекущиеДанные.Скидка = Объект.ДЗ_СогласованнаяСкидка;
	// - Ромина Ю.А. 2026-10-09 
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
		
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ДЗ_Доработки

&НаКлиенте
Процедура ДЗ_ПересчитатьТаблицу(Команда)
	
	ДЗ_Пересчитать(Объект.Товары);
	ДЗ_Пересчитать(Объект.Услуги);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДЗ_Пересчитать(Таблица) 
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		РассчитатьСуммуСтроки(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_СогласованнаяСкидкаПриИзменении(Элемент)
	
		ЕстьТоварыВДокументе = (Объект.Товары.Количество() > 0);
		ЕстьУслугиВДокументе = (Объект.Услуги.Количество() > 0);
       	ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("ЕстьТоварыВДокументе", ЕстьТоварыВДокументе);
		ДопПараметры.Вставить("ЕстьУслугиВДокументе", ЕстьУслугиВДокументе);

		ТекстВопроса = "";
		Если ЕстьТоварыВДокументе Или ЕстьУслугиВДокументе Тогда
			ТекстВопроса = НСтр("ru = 'Табличная часть документа будет пересчитана. Пересчитать?'");
		КонецЕсли;
       	
		Если ЗначениеЗаполнено(ТекстВопроса) Тогда
			Оповещение = Новый ОписаниеОповещения("ЗапроситьПересчетТабличнойЧасти", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПересчетТабличнойЧасти(Результат, ДопПараметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ДопПараметры.ЕстьТоварыВДокументе Тогда
			ДЗ_Пересчитать(Объект.Товары)
		КонецЕсли;	 
		Если ДопПараметры.ЕстьУслугиВДокументе Тогда
			ДЗ_Пересчитать(Объект.Услуги)
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество)*(1 - ТекущиеДанные.Скидка/100);
		
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество)*(1 - ТекущиеДанные.Скидка/100);
		
КонецПроцедуры
#КонецОбласти
